
//  четные числа по порядку возрастания
// array = [];
// for (i = 0; i < 50; i++) {
//     if (i % 2 === 0) {
//         array.push(i);
//     }
// }


//  нечетные числа по порядку возрастания

// array1 = [];

// for (i = 1; i < 50; i++) {
//     if (i % 2 !== 0) {
//         array1.push(i)
//     }
// }
// убывающий массив из чисел которые делятся на 3

// array2 = [];
// for (i = 50; i > 1; i--) {
//     if (i % 3 === 0) {
//         array2.push(i)
//     }
// }
//  массив каждый  элемент которого равен квадрату своего индекса

array3 = [];
for (i = 0; i < 50; i++) {
    if (array3(i) = i * i) {
        array3.push(i)
    }
}
console.log(array3);
